app/controllers/tasks_controller.rb

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        task_id = params[:id].to_i
        @task = Task.find(task_id)

INSERT INTO "tasks" ("task_name", "description", "due_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["task_name", "Get Stuff Done"], ["description", "GSD"], ["due_date", "July 19, 2019"], ["created_at", "2019-07-18 22:40:57.530640"], ["updated_at", "2019-07-18 22:40:57.530640"]]
---
    def create
        @task = Task.new(task_name: params[:task][:task_name], description: params[:task][:description],due_date: params[:task][:due_date] ) #instantiate a new book
        if @task.save # save returns true if the database insert succeeds